OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.23.08/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.23.08/tmp/merged_unpadded.lef at line 68119.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.23.08/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.23.08/results/placement/asic_watch.placement.def
[INFO ODB-0128] Design: asic_watch
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 595 components and 3571 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 2176 connections.
[INFO ODB-0133]     Created 457 nets and 1394 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.23.08/results/placement/asic_watch.placement.def
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 10255
[INFO GRT-0019] Found 0 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 29
[INFO GRT-0017] Processing 12328 blockages on layer li1.
[INFO GRT-0017] Processing 2299 blockages on layer met1.
[INFO GRT-0017] Processing 5 blockages on layer met4.
[INFO GRT-0017] Processing 5 blockages on layer met5.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical         3360           294          91.25%
met1       Horizontal       4480          3316          25.98%
met2       Vertical         3360          3240          3.57%
met3       Horizontal       2240          2067          7.72%
met4       Vertical         1344          1270          5.51%
met5       Horizontal        448           403          10.04%
---------------------------------------------------------------

[INFO GRT-0191] Wirelength: 1380, Wirelength1: 0
[INFO GRT-0192] Number of segments: 763
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0097] First L Route.
[INFO GRT-0191] Wirelength: 1380, Wirelength1: 1380
[INFO GRT-0192] Number of segments: 763
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 5786
[INFO GRT-0137] Total vCap               : 4804
[INFO GRT-0138] Total usage              : 1380
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0098] Second L Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 5786
[INFO GRT-0137] Total vCap               : 4804
[INFO GRT-0138] Total usage              : 1380
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0099] First Z Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 5786
[INFO GRT-0137] Total vCap               : 4804
[INFO GRT-0138] Total usage              : 1380
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0100] LV routing round 0, enlarge 10.
[INFO GRT-0182] 10 threshold, 10 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 1380
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 1, enlarge 15.
[INFO GRT-0182] 5 threshold, 15 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 1380
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 2, enlarge 20.
[INFO GRT-0182] 1 threshold, 20 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 1380
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

Usage checked
[INFO GRT-0105] Maze routing finished.
Final 2D results:
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 1380
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0106] Layer assignment begins.
[INFO GRT-0107] Layer assignment finished.
[INFO GRT-0108] Post-processing begins.
[INFO GRT-0109] Post-processing finished.
 Starting via filling.
[INFO GRT-0197] Via related to pin nodes: 1764
[INFO GRT-0198] Via related Steiner nodes: 29
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 1955
[INFO GRT-0112] Final usage 3D: 7240
[WARNING GRT-0211] dbGcellGrid already exists in db. Clearing existing dbGCellGrid.

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                294            37           12.59%             0 /  0 /  0
met1              3316           706           21.29%             0 /  0 /  0
met2              3240           632           19.51%             0 /  0 /  0
met3              2067             0            0.00%             0 /  0 /  0
met4              1270             0            0.00%             0 /  0 /  0
met5               403             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total            10590          1375           12.98%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 16918 um
[INFO GRT-0006] Repairing antennas, iteration 1.
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 3 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: 
disconnected net 400  inst_div32768.count_int\[2\]
Notice 0: Split top of 6 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 4 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
[INFO GRT-0012] Antenna violations: 0
[INFO GRT-0014] Routed nets: 452
###############################################################################
# Created by write_sdc
# Sat Dec 25 14:24:04 2021
###############################################################################
current_design asic_watch
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sysclk_i -period 10.0000 [get_ports {sysclk_i}]
set_clock_transition 0.1500 [get_clocks {sysclk_i}]
set_clock_uncertainty 0.2500 sysclk_i
set_propagated_clock [get_clocks {sysclk_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {dvalid_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {rstn_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {smode_i}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {segment_hxxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dvalid_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstn_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {smode_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sysclk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[0]}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: _648_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _684_ (removal check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.48    0.48   clock network delay (propagated)
                  0.13    0.00    0.48 ^ _648_/CLK (sky130_fd_sc_hd__dfrtp_4)
                  0.30    0.56    1.05 ^ _648_/Q (sky130_fd_sc_hd__dfrtp_4)
    22    0.10                           inst_count10m.rstn_i (net)
                  0.30    0.01    1.05 ^ hold3/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.23    0.25    1.30 ^ hold3/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     2    0.02                           net46 (net)
                  0.23    0.00    1.31 ^ _684_/SET_B (sky130_fd_sc_hd__dfstp_2)
                                  1.31   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.61    0.61   clock network delay (propagated)
                          0.25    0.86   clock uncertainty
                         -0.05    0.81   clock reconvergence pessimism
                                  0.81 ^ _684_/CLK (sky130_fd_sc_hd__dfstp_2)
                          0.17    0.98   library removal time
                                  0.98   data required time
-----------------------------------------------------------------------------
                                  0.98   data required time
                                 -1.31   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


Startpoint: _650_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _651_ (rising edge-triggered flip-flop clocked by sysclk_i)
Path Group: sysclk_i
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.48    0.48   clock network delay (propagated)
                  0.13    0.00    0.48 ^ _650_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.13    0.37    0.86 ^ _650_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           inst_div32768.count_int[0] (net)
                  0.13    0.00    0.86 ^ _596_/A2 (sky130_fd_sc_hd__o21a_1)
                  0.06    0.12    0.98 ^ _596_/X (sky130_fd_sc_hd__o21a_1)
     1    0.01                           _049_ (net)
                  0.06    0.00    0.98 ^ _651_/D (sky130_fd_sc_hd__dfrtp_1)
                                  0.98   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.63    0.63   clock network delay (propagated)
                          0.25    0.88   clock uncertainty
                         -0.05    0.84   clock reconvergence pessimism
                                  0.84 ^ _651_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.02    0.82   library hold time
                                  0.82   data required time
-----------------------------------------------------------------------------
                                  0.82   data required time
                                 -0.98   data arrival time
-----------------------------------------------------------------------------
                                  0.16   slack (MET)


Startpoint: rstn_i (input port clocked by sysclk_i)
Endpoint: _648_ (recovery check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          2.00    2.00 ^ input external delay
                  0.06    0.04    2.04 ^ rstn_i (in)
     1    0.01                           rstn_i (net)
                  0.06    0.00    2.04 ^ input14/A (sky130_fd_sc_hd__buf_6)
                  0.17    0.19    2.23 ^ input14/X (sky130_fd_sc_hd__buf_6)
    14    0.08                           net14 (net)
                  0.18    0.03    2.27 ^ _648_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                  2.27   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.48   10.48   clock network delay (propagated)
                         -0.25   10.23   clock uncertainty
                          0.00   10.23   clock reconvergence pessimism
                                 10.23 ^ _648_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.20   10.43   library recovery time
                                 10.43   data required time
-----------------------------------------------------------------------------
                                 10.43   data required time
                                 -2.27   data arrival time
-----------------------------------------------------------------------------
                                  8.17   slack (MET)


Startpoint: _645_ (falling edge-triggered flip-flop)
Endpoint: segment_xhxx[2] (output port clocked by sysclk_i)
Path Group: sysclk_i
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.03    0.00    0.00 v _645_/CLK_N (sky130_fd_sc_hd__dfbbn_2)
                  0.10    0.71    0.71 v _645_/Q (sky130_fd_sc_hd__dfbbn_2)
     6    0.03                           inst_count24h.count_int[2] (net)
                  0.10    0.02    0.73 v _441_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.10    0.83 ^ _441_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _184_ (net)
                  0.07    0.00    0.83 ^ _442_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.12    0.95 ^ _442_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _185_ (net)
                  0.05    0.00    0.96 ^ _443_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.20    1.15 ^ _443_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     3    0.02                           _024_ (net)
                  0.17    0.01    1.16 ^ _444_/A (sky130_fd_sc_hd__clkinv_2)
                  0.05    0.07    1.24 v _444_/Y (sky130_fd_sc_hd__clkinv_2)
     1    0.00                           _023_ (net)
                  0.05    0.00    1.24 v _630_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.31    1.54 v _630_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _031_ (net)
                  0.06    0.00    1.55 v _452_/A (sky130_fd_sc_hd__nor3b_1)
                  0.29    0.32    1.87 ^ _452_/Y (sky130_fd_sc_hd__nor3b_1)
     2    0.01                           _190_ (net)
                  0.29    0.00    1.87 ^ _453_/A (sky130_fd_sc_hd__or2b_1)
                  0.05    0.17    2.04 ^ _453_/X (sky130_fd_sc_hd__or2b_1)
     1    0.00                           _191_ (net)
                  0.05    0.00    2.04 ^ _454_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.12    0.15    2.19 ^ _454_/X (sky130_fd_sc_hd__clkbuf_1)
     2    0.01                           _032_ (net)
                  0.12    0.00    2.19 ^ _631_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.15    0.24    2.43 ^ _631_/X (sky130_fd_sc_hd__mux2_1)
     4    0.02                           _034_ (net)
                  0.15    0.01    2.44 ^ _470_/B (sky130_fd_sc_hd__or2_1)
                  0.08    0.16    2.60 ^ _470_/X (sky130_fd_sc_hd__or2_1)
     2    0.01                           _204_ (net)
                  0.08    0.00    2.60 ^ _471_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.15    0.21    2.81 ^ _471_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.03                           _205_ (net)
                  0.15    0.01    2.81 ^ _487_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.07    2.89 v _487_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _220_ (net)
                  0.05    0.00    2.89 v _489_/A3 (sky130_fd_sc_hd__a31o_1)
                  0.06    0.26    3.15 v _489_/X (sky130_fd_sc_hd__a31o_1)
     2    0.01                           _222_ (net)
                  0.06    0.00    3.15 v _495_/A (sky130_fd_sc_hd__or3b_1)
                  0.10    0.46    3.62 v _495_/X (sky130_fd_sc_hd__or3b_1)
     3    0.01                           _227_ (net)
                  0.10    0.00    3.62 v _496_/B (sky130_fd_sc_hd__or3b_2)
                  0.12    0.57    4.19 v _496_/X (sky130_fd_sc_hd__or3b_2)
     1    0.02                           _228_ (net)
                  0.12    0.01    4.20 v _497_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.14    4.34 v _497_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           net25 (net)
                  0.03    0.00    4.34 v output25/A (sky130_fd_sc_hd__buf_2)
                  0.10    0.19    4.53 v output25/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           segment_xhxx[2] (net)
                  0.10    0.01    4.55 v segment_xhxx[2] (out)
                                  4.55   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (propagated)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -4.55   data arrival time
-----------------------------------------------------------------------------
                                  3.20   slack (MET)


min_max_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
