OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef at line 68119.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/results/placement/asic_watch2.placement.def
[INFO ODB-0128] Design: asic_watch2
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 4097 components and 11323 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 9840 connections.
[INFO ODB-0133]     Created 501 nets and 1482 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/results/placement/asic_watch2.placement.def
###############################################################################
# Created by write_sdc
# Wed Dec 29 14:26:37 2021
###############################################################################
current_design asic_watch2
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sysclk_i -period 10.0000 [get_ports {sysclk_i}]
set_clock_transition 0.1500 [get_clocks {sysclk_i}]
set_clock_uncertainty 0.2500 sysclk_i
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {dvalid_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {rst_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {smode_i}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {segment_hxxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dvalid_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {smode_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sysclk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[0]}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO]: Configuring cts characterization...
[INFO]: Performing clock tree synthesis...
[INFO]: Looking for the following net(s): sysclk_i
[INFO]: Running Clock Tree Synthesis...
[INFO CTS-0038] Number of created patterns = 50000.
[INFO CTS-0038] Number of created patterns = 100000.
[INFO CTS-0039] Number of created patterns = 137808.
[INFO CTS-0084] Compiling LUT.
Min. len    Max. len    Min. cap    Max. cap    Min. slew   Max. slew
2           8           1           36          1           150         
[WARNING CTS-0043] 4752 wires are pure wire and no slew degradation.
TritonCTS forced slew degradation on these wires.
[INFO CTS-0046]     Number of wire segments: 136611.
[INFO CTS-0047]     Number of keys in characterization LUT: 1923.
[INFO CTS-0048]     Actual min input cap: 1.
[INFO CTS-0001] Running TritonCTS with user-specified clock roots: sysclk_i.
[INFO CTS-0095] Net "sysclk_i" found.
[INFO CTS-0010]  Clock net "sysclk_i" has 30 sinks.
[INFO CTS-0008] TritonCTS found 1 clock nets.
[INFO CTS-0097] Characterization used 3 buffer(s) types.
[INFO CTS-0027] Generating H-Tree topology for net sysclk_i.
[INFO CTS-0028]  Total number of sinks: 30.
[INFO CTS-0029]  Sinks will be clustered in groups of up to 25 and with maximum cluster diameter of 50.0 um.
[INFO CTS-0030]  Number of static layers: 0.
[INFO CTS-0020]  Wire segment unit: 13000  dbu (13 um).
[INFO CTS-0023]  Original sink region: [(217385, 159060), (288155, 243500)].
[INFO CTS-0024]  Normalized sink region: [(16.7219, 12.2354), (22.1658, 18.7308)].
[INFO CTS-0025]     Width:  5.4438.
[INFO CTS-0026]     Height: 6.4954.
[WARNING CTS-0045] Creating fake entries in the LUT.
 Level 1
    Direction: Vertical
    Sinks per sub-region: 15
    Sub-region size: 5.4438 X 3.2477
[INFO CTS-0034]     Segment length (rounded): 1.
    Key: 136701 outSlew: 7 load: 1 length: 1 isBuffered: true
 Level 2
    Direction: Horizontal
    Sinks per sub-region: 8
    Sub-region size: 2.7219 X 3.2477
[INFO CTS-0034]     Segment length (rounded): 1.
    Key: 136706 outSlew: 7 load: 1 length: 1 isBuffered: true
 Out of 16 sinks, 4 sinks closer to other cluster.
[INFO CTS-0032]  Stop criterion found. Max number of sinks is 15.
[INFO CTS-0035]  Number of sinks covered: 30.
[INFO CTS-0036]  Average source sink dist: 21234.93 dbu.
[INFO CTS-0037]  Number of outlier sinks: 0.
[INFO CTS-0018]     Created 7 clock buffers.
[INFO CTS-0012]     Minimum number of buffers in the clock path: 3.
[INFO CTS-0013]     Maximum number of buffers in the clock path: 3.
[INFO CTS-0015]     Created 7 clock nets.
[INFO CTS-0016]     Fanout distribution for the current clock = 6:1, 7:1, 8:1, 9:1..
[INFO CTS-0017]     Max level of the clock tree: 2.
[INFO CTS-0098] Clock net "sysclk_i"
[INFO CTS-0099]  Sinks 30
[INFO CTS-0100]  Leaf buffers 0
[INFO CTS-0101]  Average sink wire length 335.0 um
[INFO CTS-0102]  Path depth 3 - 3
[INFO]: Repairing long wires on clock nets...
[INFO RSZ-0058] Using max wire length 2319um.
[INFO]: Legalizing...
Placement Analysis
---------------------------------
total displacement         30.5 u
average displacement        0.0 u
max displacement            4.3 u
original HPWL           21792.5 u
legalized HPWL          22062.7 u
delta HPWL                    1 %

[INFO DPL-0020] Mirrored 213 instances
[INFO DPL-0021] HPWL before           22062.7 u
[INFO DPL-0022] HPWL after            21768.8 u
[INFO DPL-0023] HPWL delta               -1.3 %
cts_report
[INFO CTS-0003] Total number of Clock Roots: 1.
[INFO CTS-0004] Total number of Buffers Inserted: 7.
[INFO CTS-0005] Total number of Clock Subnets: 7.
[INFO CTS-0006] Total number of Sinks: 30.
cts_report_end
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: _812_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _815_ (removal check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.70    0.70   clock network delay (propagated)
                  0.16    0.00    0.70 ^ _812_/CLK (sky130_fd_sc_hd__dfstp_4)
                  0.09    0.50    1.20 v _812_/Q (sky130_fd_sc_hd__dfstp_4)
    13    0.05                           inst_count10m.rst_i (net)
                  0.09    0.00    1.20 v _405_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.28 ^ _405_/Y (sky130_fd_sc_hd__inv_2)
     4    0.01                           _159_ (net)
                  0.06    0.00    1.28 ^ _527_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.15    1.44 ^ _527_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _232_ (net)
                  0.13    0.00    1.44 ^ _530_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.04    0.09    1.53 ^ _530_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _234_ (net)
                  0.04    0.00    1.53 ^ _531_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.07    0.09    1.61 ^ _531_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _097_ (net)
                  0.07    0.00    1.61 ^ _815_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                  1.61   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.88    0.88   clock network delay (propagated)
                          0.25    1.13   clock uncertainty
                         -0.10    1.04   clock reconvergence pessimism
                                  1.04 ^ _815_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.36    1.40   library removal time
                                  1.40   data required time
-----------------------------------------------------------------------------
                                  1.40   data required time
                                 -1.61   data arrival time
-----------------------------------------------------------------------------
                                  0.21   slack (MET)


Startpoint: _814_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _814_ (rising edge-triggered flip-flop clocked by sysclk_i)
Path Group: sysclk_i
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.72    0.72   clock network delay (propagated)
                  0.18    0.00    0.72 ^ _814_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.11    0.38    1.10 ^ _814_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           inst_div32768.count_int[0] (net)
                  0.11    0.00    1.10 ^ _757_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.03    1.13 v _757_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _043_ (net)
                  0.03    0.00    1.13 v _814_/D (sky130_fd_sc_hd__dfrtp_1)
                                  1.13   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.88    0.88   clock network delay (propagated)
                          0.25    1.13   clock uncertainty
                         -0.16    0.97   clock reconvergence pessimism
                                  0.97 ^ _814_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.01    0.97   library hold time
                                  0.97   data required time
-----------------------------------------------------------------------------
                                  0.97   data required time
                                 -1.13   data arrival time
-----------------------------------------------------------------------------
                                  0.17   slack (MET)


Startpoint: rst_i (input port clocked by sysclk_i)
Endpoint: _837_ (recovery check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          2.00    2.00 v input external delay
                  0.02    0.01    2.01 v rst_i (in)
     1    0.00                           rst_i (net)
                  0.02    0.00    2.01 v input14/A (sky130_fd_sc_hd__buf_2)
                  0.07    0.17    2.18 v input14/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           net14 (net)
                  0.07    0.00    2.18 v _445_/A (sky130_fd_sc_hd__inv_2)
                  0.17    0.17    2.35 ^ _445_/Y (sky130_fd_sc_hd__inv_2)
     2    0.04                           _191_ (net)
                  0.17    0.00    2.36 ^ _465_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.25    2.61 ^ _465_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _201_ (net)
                  0.19    0.00    2.61 ^ _466_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.24    2.85 ^ _466_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.01                           _202_ (net)
                  0.17    0.00    2.85 ^ _478_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.05    0.12    2.97 ^ _478_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _208_ (net)
                  0.05    0.00    2.97 ^ _479_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.07    0.11    3.07 ^ _479_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _119_ (net)
                  0.07    0.00    3.07 ^ _837_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                  3.07   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.67   10.67   clock network delay (propagated)
                         -0.25   10.42   clock uncertainty
                          0.00   10.42   clock reconvergence pessimism
                                 10.42 ^ _837_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.25   10.67   library recovery time
                                 10.67   data required time
-----------------------------------------------------------------------------
                                 10.67   data required time
                                 -3.07   data arrival time
-----------------------------------------------------------------------------
                                  7.59   slack (MET)


Startpoint: _809_ (falling edge-triggered flip-flop)
Endpoint: segment_xhxx[3] (output port clocked by sysclk_i)
Path Group: sysclk_i
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.03    0.00    0.00 v _809_/CLK_N (sky130_fd_sc_hd__dfbbn_2)
                  0.09    0.72    0.72 v _809_/Q (sky130_fd_sc_hd__dfbbn_2)
     6    0.03                           inst_count24h.count_int[2] (net)
                  0.09    0.00    0.72 v _616_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.08    0.80 ^ _616_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _277_ (net)
                  0.05    0.00    0.80 ^ _617_/A (sky130_fd_sc_hd__or2_1)
                  0.04    0.10    0.90 ^ _617_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _278_ (net)
                  0.04    0.00    0.90 ^ _618_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.16    0.17    1.07 ^ _618_/X (sky130_fd_sc_hd__clkbuf_1)
     3    0.01                           _024_ (net)
                  0.16    0.00    1.07 ^ _619_/A (sky130_fd_sc_hd__clkinv_2)
                  0.04    0.06    1.13 v _619_/Y (sky130_fd_sc_hd__clkinv_2)
     1    0.00                           _023_ (net)
                  0.04    0.00    1.13 v _794_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.30    1.44 v _794_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _031_ (net)
                  0.06    0.00    1.44 v _627_/A (sky130_fd_sc_hd__nor3b_1)
                  0.25    0.28    1.72 ^ _627_/Y (sky130_fd_sc_hd__nor3b_1)
     2    0.01                           _283_ (net)
                  0.25    0.00    1.72 ^ _628_/A (sky130_fd_sc_hd__or2b_1)
                  0.05    0.16    1.88 ^ _628_/X (sky130_fd_sc_hd__or2b_1)
     1    0.00                           _284_ (net)
                  0.05    0.00    1.88 ^ _629_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.12    0.15    2.03 ^ _629_/X (sky130_fd_sc_hd__clkbuf_1)
     2    0.01                           _032_ (net)
                  0.12    0.00    2.03 ^ _638_/A (sky130_fd_sc_hd__clkinv_2)
                  0.03    0.06    2.08 v _638_/Y (sky130_fd_sc_hd__clkinv_2)
     1    0.00                           _040_ (net)
                  0.03    0.00    2.08 v _798_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.12    0.39    2.47 v _798_/X (sky130_fd_sc_hd__mux2_1)
     4    0.02                           _041_ (net)
                  0.12    0.00    2.47 v _648_/B2 (sky130_fd_sc_hd__o22a_1)
                  0.08    0.24    2.71 v _648_/X (sky130_fd_sc_hd__o22a_1)
     3    0.01                           _300_ (net)
                  0.08    0.00    2.71 v _654_/B (sky130_fd_sc_hd__or2_1)
                  0.07    0.26    2.97 v _654_/X (sky130_fd_sc_hd__or2_1)
     2    0.01                           _305_ (net)
                  0.07    0.00    2.97 v _655_/C1 (sky130_fd_sc_hd__o311a_1)
                  0.07    0.14    3.12 v _655_/X (sky130_fd_sc_hd__o311a_1)
     1    0.01                           _306_ (net)
                  0.07    0.00    3.12 v _656_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07    3.18 ^ _656_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _307_ (net)
                  0.04    0.00    3.18 ^ _659_/A (sky130_fd_sc_hd__or2_1)
                  0.14    0.17    3.35 ^ _659_/X (sky130_fd_sc_hd__or2_1)
     3    0.01                           _310_ (net)
                  0.14    0.00    3.35 ^ _674_/A (sky130_fd_sc_hd__nor2_1)
                  0.04    0.07    3.43 v _674_/Y (sky130_fd_sc_hd__nor2_1)
     1    0.00                           _323_ (net)
                  0.04    0.00    3.43 v _675_/D (sky130_fd_sc_hd__or4_4)
                  0.15    0.56    3.99 v _675_/X (sky130_fd_sc_hd__or4_4)
     1    0.04                           _324_ (net)
                  0.15    0.01    3.99 v _676_/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.25    4.25 v _676_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           segment_xhxx[3] (net)
                  0.09    0.00    4.25 v segment_xhxx[3] (out)
                                  4.25   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (propagated)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -4.25   data arrival time
-----------------------------------------------------------------------------
                                  3.50   slack (MET)


min_max_report_end
clock_skew_report
Clock sysclk_i
Latency      CRPR       Skew
_824_/CLK ^
   0.88
_826_/CLK ^
   0.70     -0.12       0.06

clock_skew_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
