OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef at line 68119.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/floorplan/6-pdn.def
[INFO ODB-0128] Design: asic_watch2
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 4082 components and 11233 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 9780 connections.
[INFO ODB-0133]     Created 486 nets and 1452 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/floorplan/6-pdn.def
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 494040 486880
[INFO GPL-0006] NumInstances: 4082
[INFO GPL-0007] NumPlaceInstances: 458
[INFO GPL-0008] NumFixedInstances: 3624
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 486
[INFO GPL-0011] NumPins: 1496
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 500000 500000
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 494040 486880
[INFO GPL-0016] CoreArea: 232535520000
[INFO GPL-0017] NonPlaceInstsArea: 5410188800
[INFO GPL-0018] PlaceInstsArea: 3902492800
[INFO GPL-0019] Util(%): 1.72
[INFO GPL-0020] StdInstsArea: 3902492800
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG Error: 0.00001428 HPWL: 26129960
[InitialPlace]  Iter: 2 CG Error: 0.00010097 HPWL: 20991466
[InitialPlace]  Iter: 3 CG Error: 0.00000117 HPWL: 20966952
[InitialPlace]  Iter: 4 CG Error: 0.00000032 HPWL: 20927797
[InitialPlace]  Iter: 5 CG Error: 0.00000024 HPWL: 20845750
[INFO GPL-0031] FillerInit: NumGCells: 15023
[INFO GPL-0032] FillerInit: NumGNets: 486
[INFO GPL-0033] FillerInit: NumGPins: 1496
[INFO GPL-0023] TargetDensity: 0.50
[INFO GPL-0024] AveragePlaceInstArea: 8520726
[INFO GPL-0025] IdealBinArea: 17041452
[INFO GPL-0026] IdealBinCnt: 13645
[INFO GPL-0027] TotalBinArea: 232535520000
[INFO GPL-0028] BinCnt: 64 64
[INFO GPL-0029] BinSize: 7634 7438
[INFO GPL-0030] NumBins: 4096
[NesterovSolve] Iter: 1 overflow: 0.843065 HPWL: 21959266
[INFO GPL-0100] worst slack 1e+30
[WARNING GPL-0102] No slacks found. Timing-driven mode disabled.
[NesterovSolve] Snapshot saved at iter = 4
[NesterovSolve] Iter: 10 overflow: 0.595594 HPWL: 20256201
[NesterovSolve] Iter: 20 overflow: 0.534356 HPWL: 19942363
[NesterovSolve] Iter: 30 overflow: 0.526948 HPWL: 19767689
[NesterovSolve] Iter: 40 overflow: 0.523944 HPWL: 19755495
[NesterovSolve] Iter: 50 overflow: 0.521825 HPWL: 19714465
[NesterovSolve] Iter: 60 overflow: 0.524396 HPWL: 19712036
[NesterovSolve] Iter: 70 overflow: 0.525593 HPWL: 19729835
[NesterovSolve] Iter: 80 overflow: 0.529015 HPWL: 19751671
[NesterovSolve] Iter: 90 overflow: 0.526858 HPWL: 19789482
[NesterovSolve] Iter: 100 overflow: 0.527009 HPWL: 19765586
[NesterovSolve] Iter: 110 overflow: 0.527086 HPWL: 19777196
[NesterovSolve] Iter: 120 overflow: 0.52731 HPWL: 19781548
[NesterovSolve] Iter: 130 overflow: 0.526765 HPWL: 19790443
[NesterovSolve] Iter: 140 overflow: 0.527006 HPWL: 19805360
[NesterovSolve] Iter: 150 overflow: 0.525884 HPWL: 19813532
[NesterovSolve] Iter: 160 overflow: 0.524432 HPWL: 19821977
[NesterovSolve] Iter: 170 overflow: 0.522843 HPWL: 19835691
[NesterovSolve] Iter: 180 overflow: 0.519528 HPWL: 19836420
[NesterovSolve] Iter: 190 overflow: 0.516626 HPWL: 19791629
[NesterovSolve] Iter: 200 overflow: 0.510041 HPWL: 19712501
[NesterovSolve] Iter: 210 overflow: 0.500945 HPWL: 19742465
[NesterovSolve] Iter: 220 overflow: 0.478318 HPWL: 19610244
[NesterovSolve] Iter: 230 overflow: 0.451698 HPWL: 19478518
[NesterovSolve] Iter: 240 overflow: 0.428027 HPWL: 19336920
[NesterovSolve] Iter: 250 overflow: 0.408792 HPWL: 19379383
[NesterovSolve] Iter: 260 overflow: 0.384769 HPWL: 19330416
[NesterovSolve] Iter: 270 overflow: 0.365455 HPWL: 19273291
[NesterovSolve] Iter: 280 overflow: 0.336917 HPWL: 19213362
[NesterovSolve] Iter: 290 overflow: 0.316297 HPWL: 19246027
[NesterovSolve] Iter: 300 overflow: 0.296609 HPWL: 19297912
[NesterovSolve] Iter: 310 overflow: 0.272661 HPWL: 19344738
[NesterovSolve] Iter: 320 overflow: 0.242962 HPWL: 19415659
[NesterovSolve] Iter: 330 overflow: 0.223547 HPWL: 19527229
[NesterovSolve] Iter: 340 overflow: 0.199861 HPWL: 19684647
[INFO GPL-0075] Routability numCall: 1 inflationIterCnt: 1 bloatIterCnt: 0
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 24848
[INFO GRT-0019] Found 0 clock nets.
[WARNING GRT-0036] Pin segment_xhxx[2] is outside die area.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 31
[INFO GRT-0017] Processing 27072 blockages on layer li1.
[INFO GRT-0017] Processing 9417 blockages on layer met1.
[INFO GRT-0017] Processing 7 blockages on layer met4.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical        77760         76315          1.86%
met1       Horizontal     103680         89488          13.69%
met2       Vertical        77760         77035          0.93%
met3       Horizontal      51840         51333          0.98%
met4       Vertical        31104         30473          2.03%
met5       Horizontal      10368         10153          2.07%
---------------------------------------------------------------

[INFO GRT-0104] Minimal overflow 2 occurring at round 0.
[INFO GRT-0111] Final number of vias: 945
[INFO GRT-0112] Final usage 3D: 5702
[WARNING GRT-0115] Global routing finished with overflow.

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1              76315          1111            1.46%             0 /  0 /  0
met1             89488          1351            1.51%             2 /  0 /  2
met2             77035           353            0.46%             0 /  0 /  0
met3             51333            50            0.10%             0 /  0 /  0
met4             30473             0            0.00%             0 /  0 /  0
met5             10153             2            0.02%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total           334797          2867            0.86%             2 /  0 /  2

[INFO GRT-0018] Total wirelength: 26157 um
[INFO GPL-0036] TileLxLy: 0 0
[INFO GPL-0037] TileSize: 6900 6900
[INFO GPL-0038] TileCnt: 72 73
[INFO GPL-0039] numRoutingLayers: 6
[INFO GPL-0040] NumTiles: 5256
[INFO GPL-0063] TotalRouteOverflowH2: 0.0
[INFO GPL-0064] TotalRouteOverflowV2: 0.0
[INFO GPL-0065] OverflowTileCnt2: 0
[INFO GPL-0066] 0.5%RC: 0.601973684994798
[INFO GPL-0067] 1.0%RC: 0.5378289446234703
[INFO GPL-0068] 2.0%RC: 0.4360197385478961
[INFO GPL-0069] 5.0%RC: 0.3049342129575579
[INFO GPL-0070] 0.5rcK: 1.0
[INFO GPL-0071] 1.0rcK: 1.0
[INFO GPL-0072] 2.0rcK: 0.0
[INFO GPL-0073] 5.0rcK: 0.0
[INFO GPL-0074] FinalRC: 0.5699013
[NesterovSolve] Iter: 350 overflow: 0.167285 HPWL: 19764970
[NesterovSolve] Iter: 360 overflow: 0.143625 HPWL: 19892140
[NesterovSolve] Iter: 370 overflow: 0.115833 HPWL: 19968431
[NesterovSolve] Finished with Overflow: 0.096744
[WARNING STA-0053] /home/zerotoasic/asic_tools/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 1, library sky130_fd_sc_hd__tt_025C_1v80 already exists.
###############################################################################
# Created by write_sdc
# Wed Dec 29 14:26:31 2021
###############################################################################
current_design asic_watch2
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sysclk_i -period 10.0000 [get_ports {sysclk_i}]
set_clock_transition 0.1500 [get_clocks {sysclk_i}]
set_clock_uncertainty 0.2500 sysclk_i
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {dvalid_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {rst_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {smode_i}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {segment_hxxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dvalid_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {smode_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sysclk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[0]}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: _812_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _815_ (removal check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _812_/CLK (sky130_fd_sc_hd__dfstp_2)
                  0.18    0.62    0.62 v _812_/Q (sky130_fd_sc_hd__dfstp_2)
    13    0.08                           inst_count10m.rst_i (net)
                  0.18    0.00    0.62 v _405_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.10    0.72 ^ _405_/Y (sky130_fd_sc_hd__inv_2)
     4    0.01                           _159_ (net)
                  0.07    0.00    0.72 ^ _527_/A (sky130_fd_sc_hd__buf_1)
                  0.27    0.22    0.94 ^ _527_/X (sky130_fd_sc_hd__buf_1)
     5    0.02                           _232_ (net)
                  0.27    0.00    0.94 ^ _530_/A (sky130_fd_sc_hd__buf_1)
                  0.05    0.11    1.05 ^ _530_/X (sky130_fd_sc_hd__buf_1)
     1    0.00                           _234_ (net)
                  0.05    0.00    1.05 ^ _531_/A (sky130_fd_sc_hd__buf_1)
                  0.06    0.08    1.13 ^ _531_/X (sky130_fd_sc_hd__buf_1)
     1    0.00                           _097_ (net)
                  0.06    0.00    1.13 ^ _815_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                  1.13   data arrival time

                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _815_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.53    0.78   library removal time
                                  0.78   data required time
-----------------------------------------------------------------------------
                                  0.78   data required time
                                 -1.13   data arrival time
-----------------------------------------------------------------------------
                                  0.36   slack (MET)


Startpoint: _814_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _814_ (rising edge-triggered flip-flop clocked by sysclk_i)
Path Group: sysclk_i
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _814_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.08    0.52    0.52 ^ _814_/Q (sky130_fd_sc_hd__dfrtp_2)
     3    0.01                           inst_div32768.count_int[0] (net)
                  0.08    0.00    0.52 ^ _757_/A (sky130_fd_sc_hd__inv_2)
                  0.02    0.03    0.55 v _757_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _043_ (net)
                  0.02    0.00    0.55 v _814_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.55   data arrival time

                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _814_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.12    0.37   library hold time
                                  0.37   data required time
-----------------------------------------------------------------------------
                                  0.37   data required time
                                 -0.55   data arrival time
-----------------------------------------------------------------------------
                                  0.18   slack (MET)


Startpoint: rst_i (input port clocked by sysclk_i)
Endpoint: _837_ (recovery check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 v input external delay
                  0.13    0.10    2.10 v rst_i (in)
     1    0.03                           rst_i (net)
                  0.13    0.00    2.10 v _445_/A (sky130_fd_sc_hd__inv_2)
                  0.17    0.20    2.30 ^ _445_/Y (sky130_fd_sc_hd__inv_2)
     2    0.04                           _191_ (net)
                  0.17    0.00    2.31 ^ _465_/A (sky130_fd_sc_hd__buf_1)
                  0.20    0.24    2.55 ^ _465_/X (sky130_fd_sc_hd__buf_1)
     5    0.02                           _201_ (net)
                  0.20    0.00    2.55 ^ _466_/A (sky130_fd_sc_hd__buf_1)
                  0.19    0.23    2.78 ^ _466_/X (sky130_fd_sc_hd__buf_1)
     5    0.02                           _202_ (net)
                  0.19    0.00    2.78 ^ _478_/A (sky130_fd_sc_hd__buf_1)
                  0.05    0.13    2.91 ^ _478_/X (sky130_fd_sc_hd__buf_1)
     1    0.00                           _208_ (net)
                  0.05    0.00    2.91 ^ _479_/A (sky130_fd_sc_hd__buf_1)
                  0.06    0.10    3.02 ^ _479_/X (sky130_fd_sc_hd__buf_1)
     1    0.00                           _119_ (net)
                  0.06    0.00    3.02 ^ _837_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                  3.02   data arrival time

                  0.15   10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                                  9.75 ^ _837_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.44   10.19   library recovery time
                                 10.19   data required time
-----------------------------------------------------------------------------
                                 10.19   data required time
                                 -3.02   data arrival time
-----------------------------------------------------------------------------
                                  7.17   slack (MET)


Startpoint: _809_ (falling edge-triggered flip-flop)
Endpoint: segment_xhxx[2] (output port clocked by sysclk_i)
Path Group: sysclk_i
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.03    0.00    0.00 v _809_/CLK_N (sky130_fd_sc_hd__dfbbn_2)
                  0.07    0.70    0.70 v _809_/Q (sky130_fd_sc_hd__dfbbn_2)
     6    0.02                           inst_count24h.count_int[2] (net)
                  0.07    0.00    0.70 v _616_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07    0.77 ^ _616_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _277_ (net)
                  0.04    0.00    0.77 ^ _617_/A (sky130_fd_sc_hd__or2_2)
                  0.03    0.10    0.87 ^ _617_/X (sky130_fd_sc_hd__or2_2)
     1    0.00                           _278_ (net)
                  0.03    0.00    0.87 ^ _618_/A (sky130_fd_sc_hd__buf_1)
                  0.16    0.17    1.04 ^ _618_/X (sky130_fd_sc_hd__buf_1)
     3    0.01                           _024_ (net)
                  0.16    0.00    1.04 ^ _619_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.04    1.07 v _619_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _023_ (net)
                  0.03    0.00    1.07 v _794_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.31    1.39 v _794_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _031_ (net)
                  0.06    0.00    1.39 v _627_/A (sky130_fd_sc_hd__nor3b_2)
                  0.18    0.24    1.63 ^ _627_/Y (sky130_fd_sc_hd__nor3b_2)
     2    0.01                           _283_ (net)
                  0.18    0.00    1.63 ^ _628_/A (sky130_fd_sc_hd__or2b_2)
                  0.03    0.15    1.78 ^ _628_/X (sky130_fd_sc_hd__or2b_2)
     1    0.00                           _284_ (net)
                  0.03    0.00    1.78 ^ _629_/A (sky130_fd_sc_hd__buf_1)
                  0.10    0.12    1.90 ^ _629_/X (sky130_fd_sc_hd__buf_1)
     2    0.01                           _032_ (net)
                  0.10    0.00    1.90 ^ _795_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.10    0.20    2.10 ^ _795_/X (sky130_fd_sc_hd__mux2_1)
     4    0.01                           _034_ (net)
                  0.10    0.00    2.10 ^ _645_/B (sky130_fd_sc_hd__or2_2)
                  0.04    0.13    2.24 ^ _645_/X (sky130_fd_sc_hd__or2_2)
     2    0.00                           _297_ (net)
                  0.04    0.00    2.24 ^ _646_/A (sky130_fd_sc_hd__buf_1)
                  0.22    0.22    2.45 ^ _646_/X (sky130_fd_sc_hd__buf_1)
     5    0.02                           _298_ (net)
                  0.22    0.00    2.45 ^ _662_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.07    2.53 v _662_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _313_ (net)
                  0.05    0.00    2.53 v _664_/A3 (sky130_fd_sc_hd__a31o_2)
                  0.04    0.27    2.80 v _664_/X (sky130_fd_sc_hd__a31o_2)
     2    0.01                           _315_ (net)
                  0.04    0.00    2.80 v _670_/A (sky130_fd_sc_hd__or3b_2)
                  0.10    0.54    3.34 v _670_/X (sky130_fd_sc_hd__or3b_2)
     3    0.01                           _320_ (net)
                  0.10    0.00    3.34 v _671_/B (sky130_fd_sc_hd__or3b_2)
                  0.25    0.73    4.07 v _671_/X (sky130_fd_sc_hd__or3b_2)
     1    0.07                           _321_ (net)
                  0.25    0.02    4.09 v _672_/A (sky130_fd_sc_hd__buf_1)
                  0.22    0.34    4.43 v _672_/X (sky130_fd_sc_hd__buf_1)
     1    0.03                           segment_xhxx[2] (net)
                  0.22    0.00    4.43 v segment_xhxx[2] (out)
                                  4.43   data arrival time

                  0.15   10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -4.43   data arrival time
-----------------------------------------------------------------------------
                                  3.32   slack (MET)


min_max_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
