OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef at line 68119.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/results/placement/asic_watch2.placement.def
[INFO ODB-0128] Design: asic_watch2
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 4104 components and 11365 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 9868 connections.
[INFO ODB-0133]     Created 508 nets and 1496 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/asic_watch2/runs/RUN_2021.12.29_14.26.25/results/placement/asic_watch2.placement.def
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met4
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 0.6150
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 25460
[INFO GRT-0019] Found 0 clock nets.
[WARNING GRT-0036] Pin segment_xhxx[2] is outside die area.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 28
[INFO GRT-0017] Processing 27898 blockages on layer li1.
[INFO GRT-0017] Processing 9481 blockages on layer met1.
[INFO GRT-0017] Processing 7 blockages on layer met4.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical        77760          1343          98.27%
met1       Horizontal     103680         89498          13.68%
met2       Vertical        77760         77035          0.93%
met3       Horizontal      51840         51333          0.98%
met4       Vertical        36288         35514          2.13%
---------------------------------------------------------------

[INFO GRT-0191] Wirelength: 3251, Wirelength1: 0
[INFO GRT-0192] Number of segments: 816
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0097] First L Route.
[INFO GRT-0191] Wirelength: 3251, Wirelength1: 3251
[INFO GRT-0192] Number of segments: 816
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 140831
[INFO GRT-0137] Total vCap               : 113892
[INFO GRT-0138] Total usage              : 3251
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0098] Second L Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 140831
[INFO GRT-0137] Total vCap               : 113892
[INFO GRT-0138] Total usage              : 3251
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0099] First Z Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 140831
[INFO GRT-0137] Total vCap               : 113892
[INFO GRT-0138] Total usage              : 3251
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0100] LV routing round 0, enlarge 10.
[INFO GRT-0182] 10 threshold, 10 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 3251
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 1, enlarge 15.
[INFO GRT-0182] 5 threshold, 15 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 3251
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 2, enlarge 20.
[INFO GRT-0182] 1 threshold, 20 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 3251
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

Usage checked
[INFO GRT-0105] Maze routing finished.
Final 2D results:
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 3251
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0106] Layer assignment begins.
[INFO GRT-0107] Layer assignment finished.
[INFO GRT-0108] Post-processing begins.
[INFO GRT-0109] Post-processing finished.
 Starting via filling.
[INFO GRT-0197] Via related to pin nodes: 1931
[INFO GRT-0198] Via related Steiner nodes: 27
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 2148
[INFO GRT-0112] Final usage 3D: 9690
[WARNING GRT-0211] dbGcellGrid already exists in db. Clearing existing dbGCellGrid.

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1               1343             1            0.07%             0 /  0 /  0
met1             89498          1592            1.78%             0 /  0 /  0
met2             77035          1653            2.15%             0 /  0 /  0
met3             51333             0            0.00%             0 /  0 /  0
met4             35514             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total           254723          3246            1.27%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 30649 um
[INFO GRT-0006] Repairing antennas, iteration 1.
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
[INFO GRT-0012] Antenna violations: 5
[WARNING DPL-0005] Overlap check failed (1).
[INFO GRT-0015] 5 diodes inserted.
[WARNING GRT-0036] Pin segment_xhxx[2] is outside die area.
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met4
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 0.6150
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 25470
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 28
[INFO GRT-0017] Processing 27913 blockages on layer li1.
[INFO GRT-0017] Processing 9491 blockages on layer met1.
[INFO GRT-0017] Processing 7 blockages on layer met4.
[INFO GRT-0009] Nets to reroute: 357.
[INFO GRT-0111] Final number of vias: 1711
[INFO GRT-0112] Final usage 3D: 7626
[WARNING GRT-0211] dbGcellGrid already exists in db. Clearing existing dbGCellGrid.
[INFO GRT-0006] Repairing antennas, iteration 2.
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
[INFO GRT-0012] Antenna violations: 0
[WARNING DPL-0005] Overlap check failed (1).
[INFO GRT-0014] Routed nets: 503
###############################################################################
# Created by write_sdc
# Wed Dec 29 14:27:22 2021
###############################################################################
current_design asic_watch2
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sysclk_i -period 10.0000 [get_ports {sysclk_i}]
set_clock_transition 0.1500 [get_clocks {sysclk_i}]
set_clock_uncertainty 0.2500 sysclk_i
set_propagated_clock [get_clocks {sysclk_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {dvalid_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {rst_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {smode_i}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {segment_hxxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dvalid_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {smode_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sysclk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[0]}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: _812_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _815_ (removal check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.73    0.73   clock network delay (propagated)
                  0.17    0.00    0.73 ^ _812_/CLK (sky130_fd_sc_hd__dfstp_4)
                  0.10    0.51    1.24 v _812_/Q (sky130_fd_sc_hd__dfstp_4)
    13    0.06                           inst_count10m.rst_i (net)
                  0.10    0.01    1.24 v _405_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.33 ^ _405_/Y (sky130_fd_sc_hd__inv_2)
     4    0.01                           _159_ (net)
                  0.07    0.00    1.33 ^ _527_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.16    1.49 ^ _527_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _232_ (net)
                  0.13    0.00    1.50 ^ _530_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.06    0.10    1.60 ^ _530_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _234_ (net)
                  0.06    0.00    1.60 ^ _531_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.07    0.09    1.69 ^ _531_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           _097_ (net)
                  0.07    0.00    1.69 ^ _815_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                  1.69   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.91    0.91   clock network delay (propagated)
                          0.25    1.16   clock uncertainty
                         -0.10    1.06   clock reconvergence pessimism
                                  1.06 ^ _815_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.37    1.43   library removal time
                                  1.43   data required time
-----------------------------------------------------------------------------
                                  1.43   data required time
                                 -1.69   data arrival time
-----------------------------------------------------------------------------
                                  0.27   slack (MET)


Startpoint: _814_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _814_ (rising edge-triggered flip-flop clocked by sysclk_i)
Path Group: sysclk_i
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.74    0.74   clock network delay (propagated)
                  0.19    0.00    0.74 ^ _814_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.13    0.39    1.13 ^ _814_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           inst_div32768.count_int[0] (net)
                  0.13    0.00    1.14 ^ _757_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.04    1.18 v _757_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _043_ (net)
                  0.03    0.00    1.18 v _814_/D (sky130_fd_sc_hd__dfrtp_1)
                                  1.18   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.91    0.91   clock network delay (propagated)
                          0.25    1.16   clock uncertainty
                         -0.16    1.00   clock reconvergence pessimism
                                  1.00 ^ _814_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.01    0.99   library hold time
                                  0.99   data required time
-----------------------------------------------------------------------------
                                  0.99   data required time
                                 -1.18   data arrival time
-----------------------------------------------------------------------------
                                  0.19   slack (MET)


Startpoint: rst_i (input port clocked by sysclk_i)
Endpoint: _837_ (recovery check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          2.00    2.00 v input external delay
                  0.03    0.03    2.03 v rst_i (in)
     1    0.01                           rst_i (net)
                  0.03    0.00    2.03 v input14/A (sky130_fd_sc_hd__buf_2)
                  0.05    0.15    2.18 v input14/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           net14 (net)
                  0.32    0.17    2.35 v _445_/A (sky130_fd_sc_hd__inv_2)
                  0.20    0.29    2.64 ^ _445_/Y (sky130_fd_sc_hd__inv_2)
     2    0.04                           _191_ (net)
                  0.20    0.02    2.65 ^ _465_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.21    0.26    2.92 ^ _465_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _201_ (net)
                  0.21    0.01    2.92 ^ _466_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.26    3.18 ^ _466_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _202_ (net)
                  0.19    0.01    3.19 ^ _478_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.06    0.13    3.32 ^ _478_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _208_ (net)
                  0.06    0.00    3.32 ^ _479_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.08    0.12    3.44 ^ _479_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           _119_ (net)
                  0.08    0.00    3.44 ^ _837_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                  3.44   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.70   10.70   clock network delay (propagated)
                         -0.25   10.45   clock uncertainty
                          0.00   10.45   clock reconvergence pessimism
                                 10.45 ^ _837_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.25   10.70   library recovery time
                                 10.70   data required time
-----------------------------------------------------------------------------
                                 10.70   data required time
                                 -3.44   data arrival time
-----------------------------------------------------------------------------
                                  7.26   slack (MET)


Startpoint: _809_ (falling edge-triggered flip-flop)
Endpoint: segment_xhxx[3] (output port clocked by sysclk_i)
Path Group: sysclk_i
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.03    0.00    0.00 v _809_/CLK_N (sky130_fd_sc_hd__dfbbn_2)
                  0.10    0.72    0.72 v _809_/Q (sky130_fd_sc_hd__dfbbn_2)
     6    0.03                           inst_count24h.count_int[2] (net)
                  0.10    0.01    0.73 v _616_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.09    0.82 ^ _616_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _277_ (net)
                  0.06    0.00    0.82 ^ _617_/A (sky130_fd_sc_hd__or2_1)
                  0.04    0.11    0.93 ^ _617_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _278_ (net)
                  0.05    0.00    0.93 ^ _618_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.17    0.19    1.11 ^ _618_/X (sky130_fd_sc_hd__clkbuf_1)
     3    0.01                           _024_ (net)
                  0.18    0.01    1.12 ^ _619_/A (sky130_fd_sc_hd__clkinv_2)
                  0.05    0.07    1.19 v _619_/Y (sky130_fd_sc_hd__clkinv_2)
     1    0.00                           _023_ (net)
                  0.05    0.00    1.19 v _794_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.31    1.51 v _794_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _031_ (net)
                  0.06    0.00    1.51 v _627_/A (sky130_fd_sc_hd__nor3b_1)
                  0.29    0.32    1.83 ^ _627_/Y (sky130_fd_sc_hd__nor3b_1)
     2    0.01                           _283_ (net)
                  0.29    0.00    1.83 ^ _628_/A (sky130_fd_sc_hd__or2b_1)
                  0.06    0.17    2.00 ^ _628_/X (sky130_fd_sc_hd__or2b_1)
     1    0.00                           _284_ (net)
                  0.06    0.00    2.01 ^ _629_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.12    0.15    2.16 ^ _629_/X (sky130_fd_sc_hd__clkbuf_1)
     2    0.01                           _032_ (net)
                  0.12    0.00    2.16 ^ _638_/A (sky130_fd_sc_hd__clkinv_2)
                  0.03    0.06    2.21 v _638_/Y (sky130_fd_sc_hd__clkinv_2)
     1    0.00                           _040_ (net)
                  0.03    0.00    2.22 v _798_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.13    0.39    2.61 v _798_/X (sky130_fd_sc_hd__mux2_1)
     4    0.02                           _041_ (net)
                  0.13    0.00    2.61 v _648_/B2 (sky130_fd_sc_hd__o22a_1)
                  0.08    0.25    2.87 v _648_/X (sky130_fd_sc_hd__o22a_1)
     3    0.01                           _300_ (net)
                  0.08    0.00    2.87 v _654_/B (sky130_fd_sc_hd__or2_1)
                  0.07    0.27    3.14 v _654_/X (sky130_fd_sc_hd__or2_1)
     2    0.01                           _305_ (net)
                  0.07    0.00    3.14 v _655_/C1 (sky130_fd_sc_hd__o311a_1)
                  0.08    0.15    3.29 v _655_/X (sky130_fd_sc_hd__o311a_1)
     1    0.01                           _306_ (net)
                  0.08    0.00    3.30 v _656_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07    3.37 ^ _656_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _307_ (net)
                  0.04    0.00    3.37 ^ _659_/A (sky130_fd_sc_hd__or2_1)
                  0.14    0.18    3.55 ^ _659_/X (sky130_fd_sc_hd__or2_1)
     3    0.01                           _310_ (net)
                  0.14    0.01    3.55 ^ _674_/A (sky130_fd_sc_hd__nor2_1)
                  0.05    0.09    3.64 v _674_/Y (sky130_fd_sc_hd__nor2_1)
     1    0.01                           _323_ (net)
                  0.05    0.00    3.64 v _675_/D (sky130_fd_sc_hd__or4_4)
                  0.15    0.55    4.19 v _675_/X (sky130_fd_sc_hd__or4_4)
     1    0.04                           _324_ (net)
                  0.15    0.02    4.21 v _676_/A (sky130_fd_sc_hd__buf_2)
                  0.10    0.25    4.46 v _676_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           segment_xhxx[3] (net)
                  0.10    0.01    4.47 v segment_xhxx[3] (out)
                                  4.47   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (propagated)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -4.47   data arrival time
-----------------------------------------------------------------------------
                                  3.28   slack (MET)


min_max_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
