OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.40.46/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.40.46/tmp/merged_unpadded.lef at line 68119.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.40.46/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.40.46/results/placement/asic_watch.placement.def
[INFO ODB-0128] Design: asic_watch
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 1749 components and 6047 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 4708 connections.
[INFO ODB-0133]     Created 429 nets and 1338 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.40.46/results/placement/asic_watch.placement.def
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met4
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 0.6150
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 15067
[INFO GRT-0019] Found 0 clock nets.
[WARNING GRT-0036] Pin segment_xhxx[2] is outside die area.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 29
[INFO GRT-0017] Processing 17143 blockages on layer li1.
[INFO GRT-0017] Processing 4697 blockages on layer met1.
[INFO GRT-0017] Processing 4 blockages on layer met4.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical        27735           793          97.14%
met1       Horizontal      36980         31574          14.62%
met2       Vertical        27735         27300          1.57%
met3       Horizontal      18490         18186          1.64%
met4       Vertical        12943         12608          2.59%
---------------------------------------------------------------

[INFO GRT-0191] Wirelength: 2179, Wirelength1: 0
[INFO GRT-0192] Number of segments: 740
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0097] First L Route.
[INFO GRT-0191] Wirelength: 2179, Wirelength1: 2179
[INFO GRT-0192] Number of segments: 740
[INFO GRT-0193] Number of shifts: 0
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 49760
[INFO GRT-0137] Total vCap               : 40701
[INFO GRT-0138] Total usage              : 2179
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0098] Second L Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 49760
[INFO GRT-0137] Total vCap               : 40701
[INFO GRT-0138] Total usage              : 2179
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0099] First Z Route.
[INFO GRT-0135] Overflow report.
[INFO GRT-0136] Total hCap               : 49760
[INFO GRT-0137] Total vCap               : 40701
[INFO GRT-0138] Total usage              : 2179
[INFO GRT-0139] Max H overflow           : 0
[INFO GRT-0140] Max V overflow           : 0
[INFO GRT-0141] Max overflow             : 0
[INFO GRT-0142] Number of overflow edges : 0
[INFO GRT-0143] H   overflow             : 0
[INFO GRT-0144] V   overflow             : 0
[INFO GRT-0145] Final overflow           : 0

[INFO GRT-0100] LV routing round 0, enlarge 10.
[INFO GRT-0182] 10 threshold, 10 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 2179
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 1, enlarge 15.
[INFO GRT-0182] 5 threshold, 15 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 2179
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0100] LV routing round 2, enlarge 20.
[INFO GRT-0182] 1 threshold, 20 expand.
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 2179
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

Usage checked
[INFO GRT-0105] Maze routing finished.
Final 2D results:
[INFO GRT-0126] Overflow report:
[INFO GRT-0127] Total usage          : 2179
[INFO GRT-0128] Max H overflow       : 0
[INFO GRT-0129] Max V overflow       : 0
[INFO GRT-0130] Max overflow         : 0
[INFO GRT-0131] Number overflow edges: 0
[INFO GRT-0132] H   overflow         : 0
[INFO GRT-0133] V   overflow         : 0
[INFO GRT-0134] Final overflow       : 0

[INFO GRT-0106] Layer assignment begins.
[INFO GRT-0107] Layer assignment finished.
[INFO GRT-0108] Post-processing begins.
[INFO GRT-0109] Post-processing finished.
 Starting via filling.
[INFO GRT-0197] Via related to pin nodes: 1685
[INFO GRT-0198] Via related Steiner nodes: 43
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 1858
[INFO GRT-0112] Final usage 3D: 7733
[WARNING GRT-0211] dbGcellGrid already exists in db. Clearing existing dbGCellGrid.

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                793             3            0.38%             0 /  0 /  0
met1             31574          1095            3.47%             0 /  0 /  0
met2             27300          1061            3.89%             0 /  0 /  0
met3             18186             0            0.00%             0 /  0 /  0
met4             12608             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total            90461          2159            2.39%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 22149 um
[INFO GRT-0006] Repairing antennas, iteration 1.
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
[INFO GRT-0012] Antenna violations: 3
[INFO GRT-0015] 3 diodes inserted.
[WARNING GRT-0036] Pin segment_xhxx[2] is outside die area.
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met4
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 0.6150
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 15073
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 29
[INFO GRT-0017] Processing 17152 blockages on layer li1.
[INFO GRT-0017] Processing 4703 blockages on layer met1.
[INFO GRT-0017] Processing 4 blockages on layer met4.
[INFO GRT-0009] Nets to reroute: 282.
[INFO GRT-0111] Final number of vias: 1408
[INFO GRT-0112] Final usage 3D: 5916
[WARNING GRT-0211] dbGcellGrid already exists in db. Clearing existing dbGCellGrid.
[INFO GRT-0006] Repairing antennas, iteration 2.
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 2 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
Notice 0: Split top of 1 T shapes.
[INFO GRT-0012] Antenna violations: 0
[INFO GRT-0014] Routed nets: 424
###############################################################################
# Created by write_sdc
# Sat Dec 25 14:41:42 2021
###############################################################################
current_design asic_watch
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sysclk_i -period 10.0000 [get_ports {sysclk_i}]
set_clock_transition 0.1500 [get_clocks {sysclk_i}]
set_clock_uncertainty 0.2500 sysclk_i
set_propagated_clock [get_clocks {sysclk_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {dvalid_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {rstn_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {smode_i}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {segment_hxxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dvalid_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstn_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {smode_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sysclk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[0]}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: _648_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _684_ (removal check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.61    0.61   clock network delay (propagated)
                  0.14    0.00    0.61 ^ _648_/CLK (sky130_fd_sc_hd__dfrtp_4)
                  0.29    0.56    1.17 ^ _648_/Q (sky130_fd_sc_hd__dfrtp_4)
    23    0.10                           inst_count10m.rstn_i (net)
                  0.29    0.01    1.18 ^ _684_/SET_B (sky130_fd_sc_hd__dfstp_2)
                                  1.18   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.74    0.74   clock network delay (propagated)
                          0.25    0.99   clock uncertainty
                         -0.13    0.86   clock reconvergence pessimism
                                  0.86 ^ _684_/CLK (sky130_fd_sc_hd__dfstp_2)
                          0.16    1.02   library removal time
                                  1.02   data required time
-----------------------------------------------------------------------------
                                  1.02   data required time
                                 -1.18   data arrival time
-----------------------------------------------------------------------------
                                  0.16   slack (MET)


Startpoint: _650_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _650_ (rising edge-triggered flip-flop clocked by sysclk_i)
Path Group: sysclk_i
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.62    0.62   clock network delay (propagated)
                  0.17    0.00    0.62 ^ _650_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.13    0.38    1.00 ^ _650_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           inst_div32768.count_int[0] (net)
                  0.13    0.01    1.01 ^ _593_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.04    1.05 v _593_/Y (sky130_fd_sc_hd__inv_2)
     1    0.01                           _043_ (net)
                  0.03    0.00    1.05 v _650_/D (sky130_fd_sc_hd__dfrtp_1)
                                  1.05   data arrival time

                          0.00    0.00   clock sysclk_i (rise edge)
                          0.76    0.76   clock network delay (propagated)
                          0.25    1.01   clock uncertainty
                         -0.14    0.87   clock reconvergence pessimism
                                  0.87 ^ _650_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.01    0.86   library hold time
                                  0.86   data required time
-----------------------------------------------------------------------------
                                  0.86   data required time
                                 -1.05   data arrival time
-----------------------------------------------------------------------------
                                  0.19   slack (MET)


Startpoint: rstn_i (input port clocked by sysclk_i)
Endpoint: _648_ (recovery check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          2.00    2.00 ^ input external delay
                  0.10    0.07    2.07 ^ rstn_i (in)
     1    0.01                           rstn_i (net)
                  0.10    0.00    2.07 ^ input14/A (sky130_fd_sc_hd__buf_8)
                  0.17    0.19    2.26 ^ input14/X (sky130_fd_sc_hd__buf_8)
    14    0.11                           net14 (net)
                  0.20    0.06    2.32 ^ _648_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                  2.32   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.61   10.61   clock network delay (propagated)
                         -0.25   10.36   clock uncertainty
                          0.00   10.36   clock reconvergence pessimism
                                 10.36 ^ _648_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.20   10.55   library recovery time
                                 10.55   data required time
-----------------------------------------------------------------------------
                                 10.55   data required time
                                 -2.32   data arrival time
-----------------------------------------------------------------------------
                                  8.23   slack (MET)


Startpoint: _645_ (falling edge-triggered flip-flop)
Endpoint: segment_xhxx[2] (output port clocked by sysclk_i)
Path Group: sysclk_i
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.03    0.00    0.00 v _645_/CLK_N (sky130_fd_sc_hd__dfbbn_2)
                  0.10    0.72    0.72 v _645_/Q (sky130_fd_sc_hd__dfbbn_2)
     6    0.04                           inst_count24h.count_int[2] (net)
                  0.10    0.01    0.73 v _441_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.09    0.82 ^ _441_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _184_ (net)
                  0.05    0.00    0.83 ^ _442_/A (sky130_fd_sc_hd__or2_1)
                  0.04    0.10    0.93 ^ _442_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _185_ (net)
                  0.04    0.00    0.93 ^ _443_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.16    0.18    1.11 ^ _443_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     3    0.01                           _024_ (net)
                  0.16    0.01    1.12 ^ _444_/A (sky130_fd_sc_hd__clkinv_2)
                  0.04    0.07    1.19 v _444_/Y (sky130_fd_sc_hd__clkinv_2)
     1    0.00                           _023_ (net)
                  0.04    0.00    1.19 v _630_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.32    1.51 v _630_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _031_ (net)
                  0.06    0.00    1.51 v _452_/A (sky130_fd_sc_hd__nor3b_1)
                  0.26    0.30    1.81 ^ _452_/Y (sky130_fd_sc_hd__nor3b_1)
     2    0.01                           _190_ (net)
                  0.26    0.00    1.82 ^ _453_/A (sky130_fd_sc_hd__or2b_1)
                  0.05    0.17    1.98 ^ _453_/X (sky130_fd_sc_hd__or2b_1)
     1    0.00                           _191_ (net)
                  0.05    0.00    1.98 ^ _454_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.12    0.15    2.13 ^ _454_/X (sky130_fd_sc_hd__clkbuf_1)
     2    0.01                           _032_ (net)
                  0.12    0.00    2.14 ^ _631_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.15    0.24    2.38 ^ _631_/X (sky130_fd_sc_hd__mux2_1)
     4    0.02                           _034_ (net)
                  0.16    0.01    2.39 ^ _470_/B (sky130_fd_sc_hd__or2_1)
                  0.08    0.16    2.55 ^ _470_/X (sky130_fd_sc_hd__or2_1)
     2    0.01                           _204_ (net)
                  0.08    0.00    2.55 ^ _471_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.15    0.20    2.76 ^ _471_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.03                           _205_ (net)
                  0.15    0.01    2.76 ^ _487_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    2.85 v _487_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _220_ (net)
                  0.06    0.01    2.85 v _493_/A3 (sky130_fd_sc_hd__a31o_1)
                  0.07    0.27    3.13 v _493_/X (sky130_fd_sc_hd__a31o_1)
     3    0.01                           _225_ (net)
                  0.07    0.00    3.13 v _495_/B (sky130_fd_sc_hd__or3b_1)
                  0.11    0.45    3.58 v _495_/X (sky130_fd_sc_hd__or3b_1)
     3    0.01                           _227_ (net)
                  0.11    0.00    3.59 v _496_/B (sky130_fd_sc_hd__or3b_4)
                  0.13    0.51    4.10 v _496_/X (sky130_fd_sc_hd__or3b_4)
     1    0.04                           _228_ (net)
                  0.13    0.01    4.11 v _497_/A (sky130_fd_sc_hd__buf_2)
                  0.10    0.24    4.35 v _497_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           segment_xhxx[2] (net)
                  0.10    0.01    4.36 v segment_xhxx[2] (out)
                                  4.36   data arrival time

                         10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (propagated)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -4.36   data arrival time
-----------------------------------------------------------------------------
                                  3.39   slack (MET)


min_max_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
