OpenROAD GITDIR-NOTFOUND 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.45.32/tmp/merged_unpadded.lef
[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.45.32/tmp/merged_unpadded.lef at line 68119.

[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.45.32/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.45.32/tmp/floorplan/6-pdn.def
[INFO ODB-0128] Design: asic_watch
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 4000 components and 10741 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 9452 connections.
[INFO ODB-0133]     Created 404 nets and 1288 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/asic_watch/runs/RUN_2021.12.25_14.45.32/tmp/floorplan/6-pdn.def
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 494040 486880
[INFO GPL-0006] NumInstances: 4000
[INFO GPL-0007] NumPlaceInstances: 376
[INFO GPL-0008] NumFixedInstances: 3624
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 404
[INFO GPL-0011] NumPins: 1332
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 500000 500000
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 494040 486880
[INFO GPL-0016] CoreArea: 232535520000
[INFO GPL-0017] NonPlaceInstsArea: 5410188800
[INFO GPL-0018] PlaceInstsArea: 3597200000
[INFO GPL-0019] Util(%): 1.58
[INFO GPL-0020] StdInstsArea: 3597200000
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG Error: 0.00000299 HPWL: 25478200
[InitialPlace]  Iter: 2 CG Error: 0.00000148 HPWL: 20303381
[InitialPlace]  Iter: 3 CG Error: 0.00000185 HPWL: 20280733
[InitialPlace]  Iter: 4 CG Error: 0.00000222 HPWL: 20241226
[InitialPlace]  Iter: 5 CG Error: 0.00000021 HPWL: 20165465
[INFO GPL-0031] FillerInit: NumGCells: 13121
[INFO GPL-0032] FillerInit: NumGNets: 404
[INFO GPL-0033] FillerInit: NumGPins: 1332
[INFO GPL-0023] TargetDensity: 0.50
[INFO GPL-0024] AveragePlaceInstArea: 9567021
[INFO GPL-0025] IdealBinArea: 19134042
[INFO GPL-0026] IdealBinCnt: 12152
[INFO GPL-0027] TotalBinArea: 232535520000
[INFO GPL-0028] BinCnt: 64 64
[INFO GPL-0029] BinSize: 7634 7438
[INFO GPL-0030] NumBins: 4096
[NesterovSolve] Iter: 1 overflow: 0.829915 HPWL: 21880720
[INFO GPL-0100] worst slack 1e+30
[WARNING GPL-0102] No slacks found. Timing-driven mode disabled.
[NesterovSolve] Snapshot saved at iter = 4
[NesterovSolve] Iter: 10 overflow: 0.558365 HPWL: 19850660
[NesterovSolve] Iter: 20 overflow: 0.521593 HPWL: 19300560
[NesterovSolve] Iter: 30 overflow: 0.515739 HPWL: 19239636
[NesterovSolve] Iter: 40 overflow: 0.509039 HPWL: 19173302
[NesterovSolve] Iter: 50 overflow: 0.501586 HPWL: 19142493
[NesterovSolve] Iter: 60 overflow: 0.500789 HPWL: 19076054
[NesterovSolve] Iter: 70 overflow: 0.505809 HPWL: 19096096
[NesterovSolve] Iter: 80 overflow: 0.507727 HPWL: 19129524
[NesterovSolve] Iter: 90 overflow: 0.50324 HPWL: 19119023
[NesterovSolve] Iter: 100 overflow: 0.504218 HPWL: 19098266
[NesterovSolve] Iter: 110 overflow: 0.503513 HPWL: 19099191
[NesterovSolve] Iter: 120 overflow: 0.504648 HPWL: 19113252
[NesterovSolve] Iter: 130 overflow: 0.503624 HPWL: 19118479
[NesterovSolve] Iter: 140 overflow: 0.503529 HPWL: 19118476
[NesterovSolve] Iter: 150 overflow: 0.502754 HPWL: 19124759
[NesterovSolve] Iter: 160 overflow: 0.501556 HPWL: 19134632
[NesterovSolve] Iter: 170 overflow: 0.499749 HPWL: 19145368
[NesterovSolve] Iter: 180 overflow: 0.497304 HPWL: 19148233
[NesterovSolve] Iter: 190 overflow: 0.494157 HPWL: 19104397
[NesterovSolve] Iter: 200 overflow: 0.493175 HPWL: 19053371
[NesterovSolve] Iter: 210 overflow: 0.486382 HPWL: 19082829
[NesterovSolve] Iter: 220 overflow: 0.480023 HPWL: 19028176
[NesterovSolve] Iter: 230 overflow: 0.455701 HPWL: 18961947
[NesterovSolve] Iter: 240 overflow: 0.424792 HPWL: 18841987
[NesterovSolve] Iter: 250 overflow: 0.40012 HPWL: 18785722
[NesterovSolve] Iter: 260 overflow: 0.381195 HPWL: 18735295
[NesterovSolve] Iter: 270 overflow: 0.350971 HPWL: 18714070
[NesterovSolve] Iter: 280 overflow: 0.3388 HPWL: 18720208
[NesterovSolve] Iter: 290 overflow: 0.319291 HPWL: 18763891
[NesterovSolve] Iter: 300 overflow: 0.293096 HPWL: 18773090
[NesterovSolve] Iter: 310 overflow: 0.267186 HPWL: 18801463
[NesterovSolve] Iter: 320 overflow: 0.243063 HPWL: 18861173
[NesterovSolve] Iter: 330 overflow: 0.217318 HPWL: 18941471
[INFO GPL-0075] Routability numCall: 1 inflationIterCnt: 1 bloatIterCnt: 0
[INFO GRT-0020] Min routing layer: li1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 0%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0224] Chose via L1M1_PR as default.
[INFO GRT-0224] Chose via M1M2_PR as default.
[INFO GRT-0224] Chose via M2M3_PR as default.
[INFO GRT-0224] Chose via M3M4_PR as default.
[INFO GRT-0224] Chose via M4M5_PR as default.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 23990
[INFO GRT-0019] Found 0 clock nets.
[WARNING GRT-0036] Pin segment_xhxx[2] is outside die area.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 38
[INFO GRT-0017] Processing 25891 blockages on layer li1.
[INFO GRT-0017] Processing 9252 blockages on layer met1.
[INFO GRT-0017] Processing 7 blockages on layer met4.

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical        77760         76386          1.77%
met1       Horizontal     103680         89510          13.67%
met2       Vertical        77760         77035          0.93%
met3       Horizontal      51840         51333          0.98%
met4       Vertical        31104         30473          2.03%
met5       Horizontal      10368         10153          2.07%
---------------------------------------------------------------

[INFO GRT-0104] Minimal overflow 7 occurring at round 0.
[INFO GRT-0111] Final number of vias: 884
[INFO GRT-0112] Final usage 3D: 5444
[WARNING GRT-0115] Global routing finished with overflow.

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1              76386          1301            1.70%             0 /  0 /  0
met1             89510          1293            1.44%             7 /  0 /  7
met2             77035           133            0.17%             0 /  0 /  0
met3             51333            63            0.12%             0 /  0 /  0
met4             30473             0            0.00%             0 /  0 /  0
met5             10153             2            0.02%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total           334890          2792            0.83%             7 /  0 /  7

[INFO GRT-0018] Total wirelength: 25157 um
[INFO GPL-0036] TileLxLy: 0 0
[INFO GPL-0037] TileSize: 6900 6900
[INFO GPL-0038] TileCnt: 72 73
[INFO GPL-0039] numRoutingLayers: 6
[INFO GPL-0040] NumTiles: 5256
[INFO GPL-0063] TotalRouteOverflowH2: 0.0
[INFO GPL-0064] TotalRouteOverflowV2: 0.0
[INFO GPL-0065] OverflowTileCnt2: 0
[INFO GPL-0066] 0.5%RC: 0.5842105267863524
[INFO GPL-0067] 1.0%RC: 0.5279605231787029
[INFO GPL-0068] 2.0%RC: 0.42697368630845295
[INFO GPL-0069] 5.0%RC: 0.30171052931170717
[INFO GPL-0070] 0.5rcK: 1.0
[INFO GPL-0071] 1.0rcK: 1.0
[INFO GPL-0072] 2.0rcK: 0.0
[INFO GPL-0073] 5.0rcK: 0.0
[INFO GPL-0074] FinalRC: 0.5560855
[NesterovSolve] Iter: 340 overflow: 0.193092 HPWL: 19036039
[NesterovSolve] Iter: 350 overflow: 0.161002 HPWL: 19169851
[NesterovSolve] Iter: 360 overflow: 0.134618 HPWL: 19276746
[NesterovSolve] Iter: 370 overflow: 0.108202 HPWL: 19426116
[NesterovSolve] Finished with Overflow: 0.099860
[WARNING STA-0053] /home/zerotoasic/asic_tools/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 1, library sky130_fd_sc_hd__tt_025C_1v80 already exists.
###############################################################################
# Created by write_sdc
# Sat Dec 25 14:45:37 2021
###############################################################################
current_design asic_watch
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sysclk_i -period 10.0000 [get_ports {sysclk_i}]
set_clock_transition 0.1500 [get_clocks {sysclk_i}]
set_clock_uncertainty 0.2500 sysclk_i
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {cfg_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {dvalid_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {rstn_i}]
set_input_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {smode_i}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_hxxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xhxx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxmx[6]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[0]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[1]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[2]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[3]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[4]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[5]}]
set_output_delay 2.0000 -clock [get_clocks {sysclk_i}] -add_delay [get_ports {segment_xxxm[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {segment_hxxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_hxxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xhxx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxmx[0]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[6]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[5]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[4]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[3]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[2]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[1]}]
set_load -pin_load 0.0334 [get_ports {segment_xxxm[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dvalid_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstn_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {smode_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sysclk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_1 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cfg_i[0]}]
set_timing_derate -early 0.9000
set_timing_derate -late 1.1000
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
check_report
No paths found.
check_report_end
timing_report
No paths found.
timing_report_end
min_max_report
Startpoint: _648_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _650_ (removal check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _648_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.76    0.95    0.95 ^ _648_/Q (sky130_fd_sc_hd__dfrtp_2)
    37    0.16                           inst_count10m.rstn_i (net)
                  0.76    0.00    0.95 ^ _650_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                  0.95   data arrival time

                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _650_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.70    0.95   library removal time
                                  0.95   data required time
-----------------------------------------------------------------------------
                                  0.95   data required time
                                 -0.95   data arrival time
-----------------------------------------------------------------------------
                                  0.00   slack (MET)


Startpoint: _650_ (rising edge-triggered flip-flop clocked by sysclk_i)
Endpoint: _650_ (rising edge-triggered flip-flop clocked by sysclk_i)
Path Group: sysclk_i
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _650_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.08    0.52    0.52 ^ _650_/Q (sky130_fd_sc_hd__dfrtp_2)
     3    0.01                           inst_div32768.count_int[0] (net)
                  0.08    0.00    0.52 ^ _593_/A (sky130_fd_sc_hd__inv_2)
                  0.02    0.03    0.54 v _593_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _043_ (net)
                  0.02    0.00    0.54 v _650_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.54   data arrival time

                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _650_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.12    0.37   library hold time
                                  0.37   data required time
-----------------------------------------------------------------------------
                                  0.37   data required time
                                 -0.54   data arrival time
-----------------------------------------------------------------------------
                                  0.18   slack (MET)


Startpoint: rstn_i (input port clocked by sysclk_i)
Endpoint: _671_ (recovery check against rising-edge clock sysclk_i)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock sysclk_i (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.99    0.77    2.77 ^ rstn_i (in)
    14    0.12                           rstn_i (net)
                  0.99    0.00    2.77 ^ _671_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                  2.77   data arrival time

                  0.15   10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                                  9.75 ^ _671_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.17    9.92   library recovery time
                                  9.92   data required time
-----------------------------------------------------------------------------
                                  9.92   data required time
                                 -2.77   data arrival time
-----------------------------------------------------------------------------
                                  7.14   slack (MET)


Startpoint: _645_ (falling edge-triggered flip-flop)
Endpoint: segment_xhxx[2] (output port clocked by sysclk_i)
Path Group: sysclk_i
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.03    0.00    0.00 v _645_/CLK_N (sky130_fd_sc_hd__dfbbn_2)
                  0.07    0.70    0.70 v _645_/Q (sky130_fd_sc_hd__dfbbn_2)
     6    0.02                           inst_count24h.count_int[2] (net)
                  0.07    0.00    0.70 v _441_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07    0.77 ^ _441_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _184_ (net)
                  0.04    0.00    0.77 ^ _442_/A (sky130_fd_sc_hd__or2_2)
                  0.03    0.10    0.87 ^ _442_/X (sky130_fd_sc_hd__or2_2)
     1    0.00                           _185_ (net)
                  0.03    0.00    0.87 ^ _443_/A (sky130_fd_sc_hd__buf_1)
                  0.16    0.17    1.04 ^ _443_/X (sky130_fd_sc_hd__buf_1)
     3    0.01                           _024_ (net)
                  0.16    0.00    1.04 ^ _444_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.04    1.09 v _444_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _023_ (net)
                  0.03    0.00    1.09 v _630_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.07    0.32    1.41 v _630_/X (sky130_fd_sc_hd__mux2_1)
     1    0.01                           _031_ (net)
                  0.07    0.00    1.41 v _452_/A (sky130_fd_sc_hd__nor3b_2)
                  0.18    0.24    1.65 ^ _452_/Y (sky130_fd_sc_hd__nor3b_2)
     2    0.01                           _190_ (net)
                  0.18    0.00    1.65 ^ _453_/A (sky130_fd_sc_hd__or2b_2)
                  0.03    0.16    1.80 ^ _453_/X (sky130_fd_sc_hd__or2b_2)
     1    0.00                           _191_ (net)
                  0.03    0.00    1.80 ^ _454_/A (sky130_fd_sc_hd__buf_1)
                  0.10    0.13    1.93 ^ _454_/X (sky130_fd_sc_hd__buf_1)
     2    0.01                           _032_ (net)
                  0.10    0.00    1.93 ^ _631_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.10    0.20    2.13 ^ _631_/X (sky130_fd_sc_hd__mux2_1)
     4    0.01                           _034_ (net)
                  0.10    0.00    2.13 ^ _470_/B (sky130_fd_sc_hd__or2_2)
                  0.04    0.14    2.27 ^ _470_/X (sky130_fd_sc_hd__or2_2)
     2    0.01                           _204_ (net)
                  0.04    0.00    2.27 ^ _471_/A (sky130_fd_sc_hd__buf_1)
                  0.22    0.22    2.49 ^ _471_/X (sky130_fd_sc_hd__buf_1)
     5    0.02                           _205_ (net)
                  0.22    0.00    2.49 ^ _487_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.07    2.56 v _487_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _220_ (net)
                  0.05    0.00    2.56 v _489_/A3 (sky130_fd_sc_hd__a31o_2)
                  0.04    0.27    2.83 v _489_/X (sky130_fd_sc_hd__a31o_2)
     2    0.00                           _222_ (net)
                  0.04    0.00    2.83 v _495_/A (sky130_fd_sc_hd__or3b_2)
                  0.10    0.54    3.38 v _495_/X (sky130_fd_sc_hd__or3b_2)
     3    0.01                           _227_ (net)
                  0.10    0.00    3.38 v _496_/B (sky130_fd_sc_hd__or3b_2)
                  0.25    0.73    4.11 v _496_/X (sky130_fd_sc_hd__or3b_2)
     1    0.07                           _228_ (net)
                  0.25    0.02    4.13 v _497_/A (sky130_fd_sc_hd__buf_1)
                  0.22    0.34    4.47 v _497_/X (sky130_fd_sc_hd__buf_1)
     1    0.03                           segment_xhxx[2] (net)
                  0.22    0.00    4.47 v segment_xhxx[2] (out)
                                  4.47   data arrival time

                  0.15   10.00   10.00   clock sysclk_i (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -4.47   data arrival time
-----------------------------------------------------------------------------
                                  3.28   slack (MET)


min_max_report_end
wns_report
wns 0.00
wns_report_end
tns_report
tns 0.00
tns_report_end
